Tekla Open API Reference for Tekla Structures 2025
Identifier.IsValid Method
 Returns true if the identifier seems to be valid. The validation is done based on the ID or GUID property.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool IsValid()
Public Function IsValid As Boolean
Return Value
Type: Boolean
True if the identifier seems to be valid.
See Also
Reference
Identifier Class
Tekla.Structures Namespace